###################################################################

# Created by write_sdc on Sat Jun 11 17:58:15 2022

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions tt_1v8_25c -library tt_1v8_25c
set_max_area 0
create_clock [get_ports clk]  -period 4  -waveform {0 2}
set_clock_uncertainty 0.004  [get_clocks clk]
set_clock_transition -max -rise 0.01 [get_clocks clk]
set_clock_transition -max -fall 0.01 [get_clocks clk]
set_clock_transition -min -rise 0.01 [get_clocks clk]
set_clock_transition -min -fall 0.01 [get_clocks clk]
set_input_delay -clock clk  0  [get_ports rst]
set_input_delay -clock clk  0  [get_ports {IMemout[31]}]
set_input_delay -clock clk  0  [get_ports {IMemout[30]}]
set_input_delay -clock clk  0  [get_ports {IMemout[29]}]
set_input_delay -clock clk  0  [get_ports {IMemout[28]}]
set_input_delay -clock clk  0  [get_ports {IMemout[27]}]
set_input_delay -clock clk  0  [get_ports {IMemout[26]}]
set_input_delay -clock clk  0  [get_ports {IMemout[25]}]
set_input_delay -clock clk  0  [get_ports {IMemout[24]}]
set_input_delay -clock clk  0  [get_ports {IMemout[23]}]
set_input_delay -clock clk  0  [get_ports {IMemout[22]}]
set_input_delay -clock clk  0  [get_ports {IMemout[21]}]
set_input_delay -clock clk  0  [get_ports {IMemout[20]}]
set_input_delay -clock clk  0  [get_ports {IMemout[19]}]
set_input_delay -clock clk  0  [get_ports {IMemout[18]}]
set_input_delay -clock clk  0  [get_ports {IMemout[17]}]
set_input_delay -clock clk  0  [get_ports {IMemout[16]}]
set_input_delay -clock clk  0  [get_ports {IMemout[15]}]
set_input_delay -clock clk  0  [get_ports {IMemout[14]}]
set_input_delay -clock clk  0  [get_ports {IMemout[13]}]
set_input_delay -clock clk  0  [get_ports {IMemout[12]}]
set_input_delay -clock clk  0  [get_ports {IMemout[11]}]
set_input_delay -clock clk  0  [get_ports {IMemout[10]}]
set_input_delay -clock clk  0  [get_ports {IMemout[9]}]
set_input_delay -clock clk  0  [get_ports {IMemout[8]}]
set_input_delay -clock clk  0  [get_ports {IMemout[7]}]
set_input_delay -clock clk  0  [get_ports {IMemout[6]}]
set_input_delay -clock clk  0  [get_ports {IMemout[5]}]
set_input_delay -clock clk  0  [get_ports {IMemout[4]}]
set_input_delay -clock clk  0  [get_ports {IMemout[3]}]
set_input_delay -clock clk  0  [get_ports {IMemout[2]}]
set_input_delay -clock clk  0  [get_ports {IMemout[1]}]
set_input_delay -clock clk  0  [get_ports {IMemout[0]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[31]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[30]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[29]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[28]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[27]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[26]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[25]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[24]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[23]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[22]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[21]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[20]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[19]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[18]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[17]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[16]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[15]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[14]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[13]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[12]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[11]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[10]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[9]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[8]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[7]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[6]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[5]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[4]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[3]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[2]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[1]}]
set_input_delay -clock clk  0  [get_ports {DMemout_MEM[0]}]
